clc
clear
%Slist
% w1=[0;0;1];
% w2=[0;1;0];
% w3=[0;1;0];
% w4=[0;1;0];
% w5=[0;0;1];
% w6=[0;1;0];
% q1=[0;0;0];
% q2=[0;0;151.900];
% q3=[0;0;395.550];
% q4=[0;0;608.550];
% q5=[0;110.4;691.950];
% q6=[0;110.4;691.950];
% S1=[w1;cross(-w1,q1)];
% S2=[w2;cross(-w2,q2)];
% S3=[w3;cross(-w3,q3)];
% S4=[w4;cross(-w4,q4)];
% S5=[w5;cross(-w5,q5)];
% S6=[w6;cross(-w6,q6)];
% Slist=[S1,S2,S3,S4,S5,S6];
w1=[0;0;1];
w2=[0;1;0];
w3=[0;1;0];
w4=[0;1;0];
w5=[1;0;0];
w6=[0;1;0];
q1=[0;0;0];
q2=[0;0;151.900];
q3=[243.65;0;151.9];
q4=[243.65;0;448.3];
q5=[243.65;110.4;448.3];
q6=[243.65;110.4;448.3];
S1=[w1;cross(-w1,q1)];
S2=[w2;cross(-w2,q2)];
S3=[w3;cross(-w3,q3)];
S4=[w4;cross(-w4,q4)];
S5=[w5;cross(-w5,q5)];
S6=[w6;cross(-w6,q6)];
Slist=[S1,S2,S3,S4,S5,S6];
%初始构型
M=[1,0 , 0 ,0;
    0 ,1 ,0 ,267.8;
    0,0,1,691.95;
    0,0,0,1];
% M=[1,0 , 0 ,327.5853;
%     0 ,1 ,0 ,332.8;
%     0,0,1,364.9;
%     0,0,0,1];
%期望构型
TwA=[cos(pi/3),-sin(pi/3),0,220;
    sin(pi/3),cos(pi/3),0,150;
    0,0,1,160;
    0,0,0,1];
TwB=[1,0,0,180;
    0,cos(-pi/2),-sin(-pi/2),150;
    0,sin(-pi/2),cos(-pi/2),200;
    0,0,0,1];
TwC=[1,0,0,120;
    0,cos(-pi/2),-sin(-pi/2),150;
    0,sin(-pi/2),cos(-pi/2),200;
    0,0,0,1];
TwD=[cos(-pi/2),-sin(-pi/2),0,80;
    sin(-pi/2),cos(-pi/2),0,150;
    0,0,1,160;
    0,0,0,1];
    %基坐标系{s}到任务坐标系{w}的变换
    Tsw=[1,0,0,-75;
        0,1,0,250;
        0,0,1,100;
        0,0,0,1];
    TsA= Tsw*TwA;
    TsB=Tsw*TwB;
    TsC=Tsw*TwC;
    TsD=Tsw*TwD;
%参数结果
display(Slist);
display(M);
display(TsA);
display(TsB);
display(TsC);
display(TsD);
eomg=1.0e-3;
ev=1.0e-3;
thetalist0=[0;0;0;0;0;0];
 [thetalist, success]   = IKinSpace(Slist, M, TsA, thetalist0, eomg, ev)
